/* JSON file to make the e2spt_classaverage in breaksym mode wizard */
[
  {
    "TITLE":"e2spt_classaverage breaksym",
    "INST":"This Wizard is to Help users run e2spt_classaverage in breaksym mode. Once subtomograms have been aligned using a symmetric search, it can be desirable to break the symmetry to find asymmetric features such as the tail of a virus. This seach takes particles that are prealigned to their symmetry axis, searches all symmetric positions and alignes based on the best score which should be where asymetric features line up(provided the have sufficient signal). This program is CUDA enabled",
    "WIDGETS":[]
  },
  {
    "TITLE":"Input subtomogram",
    "INST":"Select the input subtomogram stack (usualy from the subtomograms directory)",
    "WIDGETS":[
      "input"
    ]
  },
  {
    "TITLE":"Output average",
    "INST":"Choose the filename of the output subtomogram average",
    "WIDGETS":[
      "output"
    ]
  },
  {
    "TITLE":"Intermidtae save options",
    "INST":"To save the average after each iteration, check 'savesteps'. To save the final alignment position of each subtomogram, check 'saveali'. To save the alignment for each particle for each iteration, check, 'saveallalign'.",
    "WIDGETS":[
      "savesteps",
      "saveali",
      "saveallalign"
    ]
  },
  {
    "TITLE":"Number of iterations",
    "INST":"Cooose the number of iterations for subtomogram alignment and averaging. This value must be >= 1",
    "WIDGETS":[
      "iter"
    ]
  },
  {
    "TITLE":"Shrink options",
    "INST":"To speed alignment, you can shrink down your subtomogram. This may lower the alignment accuracy depending on to what fraction of niquist the signal goes to.",
    "WIDGETS":[
      "shrink"
    ]
  },
  {
    "TITLE":"Subtomogram culling",
    "INST":"Using 'keep', you can choose the fraction of particles to keep based on the chosen similarity metric(highest X fraction are kept). If you want to use standard deviations rather than absolute values, check 'keepsig'.",
    "WIDGETS":[
      "keep",
      "keepsig"
    ]
  },
  {
    "TITLE":"Refinement options",
    "INST":"After an initial course search the best N peaks are refined. Set this number using ;npeakstorefine'.After alignment and averaging, the average is centered on its center of mass. This may not be desirable for all particle shapes, to turn this off, check 'nocenterofmass'",
    "WIDGETS":[
      "npeakstorefine",
      "nocenterofmass"
    ]
  },
  {
    "TITLE":"Initial position transforms",
    "INST":"After running e2spt_classaverage NOT in break sym mode, each particle will have been given a transform to mve the raw subtomogram into alignment with the reference. There is a set of such transforms for each spt_ directory. Please select the refinement direcotry you want to use",
    "WIDGETS":[
      "inixforms"
    ]
  },
  {
    "TITLE":"Subtomogram symmetry",
    "INST":"Choose the symmetry to seach over. This symmetry must be the same as what the subtomograms are alsinged to.",
    "WIDGETS":[
      "sym"
    ]
  },
  {
    "TITLE":"Preprocess subtomos",
    "INST":"If desired, select the processor to preprosess your subtomograms before alignment. The final average will not be affected by this step. If none is desired, choose 'None'. This can greatly help alignment if you have low contrasty subtomograrm and/or are trying to align a small asymmetric feature on an otherwise symmetric particle.",
    "WIDGETS":[
      "preprocess"
    ]
  },
  {
    "TITLE":"Mask subtomos",
    "INST":"If desired, select masking to apply to subtomographs prior to alignment. The final average will not be affected by this step. If none is desired, choose 'None'. Masking can aid alignment by removing background influences such as neighboring particles.",
    "WIDGETS":[
      "mask"
    ]
  },
  {
    "TITLE":"Course aligner",
    "INST":"Select the course aligner. Use rotate_translate_3d for almost all cases. Next choose the align comparitor. For now always select ccc.tomo unless you want to experiment with fsc.tomo, but you will have neede to find the missing wedge using e2wedge.py",
    "WIDGETS":[
      "align",
      "aligncmp"
    ]
  },
  {
    "TITLE":"Refine aligner",
    "INST":"Select the refine aligner. If you have high contrasty particles you can use refine_3d, otheriwse, use refine_3d_grid, which is better for low contasty particles(but is slower). Also select a comparitor, always use the smae compariotr that you used for the course aligner.",
    "WIDGETS":[
      "ralign",
      "raligncmp"
    ]
  },
  {
    "TITLE":"Postprocess average",
    "INST":"If desired, you can postprocess your subtomogram average (i.e. filter).  If none is desired, choose 'None'.",
    "WIDGETS":[
      "postprocess"
    ]
  },
  {
    "TITLE":"EMAN2 paralleism",
    "INST":"Select the EMAN2 paralleism. You can choose thread(SMP) mpi, or dc(distributed computing)",
    "WIDGETS":[
      "parallel"
    ]
  }
]