/* JSON file for the e2RCT wizard */
[
  {
    "TITLE":"e2rct Wizard",
    "INST":"This Wizard is to Help EM users fill in the GUI to generate initial model via random conical tilt. For more information read Three-Dimensional Electron Microscopy of Macromolecular Assemblies. Chapter 5.5",
    "WIDGETS":[]
  },
  {
    "TITLE":"Tilt Pair stack filenames",
    "INST":"Please eneter filename for the two tiltpair stacks. These two stacks should have the same number of particles and have been generated by e2RCTboxer.py",
    "WIDGETS":[
      "untiltdata",
      "tiltdata"
    ]
  },
  {
    "TITLE":"Classaverage file",
    "INST":"Please eneter filename of the classaverage generated from e2refine2d.py. You chould seelect the best possible class averages as the RCT quality is proportiojnal to class average quality. There will be one RCT recon for each class average that is not rejected by careject or minproj",
    "WIDGETS":[
      "classavg"
    ]
  },
  {
    "TITLE":"Tilt geometry",
    "INST":"Please enter the stage tilt. You can leave this 0 if the titl particle pairs were selected using e2RCTboxer as this value is in the metadata. Also choose if you want a titlaxis correction. If all your particles have the same tiltaxis this will have no effect(this is always the case if the partile come from a single micrograph)",
    "WIDGETS":[
      "stagetilt",
      "tiltaxis"
    ]
  },
  {
    "TITLE":"Class average selection",
    "INST":"In careject enter a comma delimited list of class averages to reject. Obtain these by visually examining the class aeverages from e2refine2d. In minproj, select the minimum acceptible number of images in a class average. If there are too few images then the RCT will look quite rubbish",
    "WIDGETS":[
      "careject",
      "minproj"
    ]
  },
  {
    "TITLE":"Intra class image alignment.",
    "INST":"Once images are selected for RCT, they should ideall be centered. Check 'align' to center the image, and maxshift to set the maximium possible translationl",
    "WIDGETS":[
      "align",
      "maxshift"
    ]
  },
  {
    "TITLE":"RCT averaging",
    "INST":"Once a RCT recon is made for each class average, they can be aligned to each other and avearged click 'avgrcts'. For RCT alignment all RCTs are aligned to the first model and averaged. In the future this will be improved to use a tree algorithm. For now, if you want better perfomance enter a reference recon to align to.",
    "WIDGETS":[
      "avgrcts",
      "reference"
    ]
  },
  {
    "TITLE":"Alignment and averaging params",
    "INST":"Select the fineness of 3D alignment, in degrees. If you want to weight each RCT by the number of particles it contains, check 'weightrecons'",
    "WIDGETS":[
      "aligngran",
      "weightrecons"
    ]
  },
  {
    "TITLE":"Avergaed RCT symmetry",
    "INST":"Once RCTs are aligned and averaged, apply a symmetry. WARNING!!! For this to work the RCT must be aligned to its symmetry axis. The only way to ensure this is to align to a reference itself aligned to its symettry axis",
    "WIDGETS":[
      "sym"
    ]
  }
]