/* JSON file to make the particle import wizard */
[
  {
    "TITLE":"e2ctf autofit Wizard",
    "INST":"This Wizard is to Help users from e2ctf in autofit mode. This program does the following: First it compute the foreground and background power. Background is defined as a circular region outside the particles. Next Fg-Bg sepctra are computed and used for fitting. First defocus is fit via least squares, then defcous and B factor are fit via simplex multidimensional miniziation using either a precomputed structure factor or the GroEL struccutre factors at high resolution domains. Finally all parameteres are refined using the simplex algorithm",
    "WIDGETS":[]
  },
  {
    "TITLE":"Select particle files",
    "INST":"Select particle stacks to use for CTF auto fitting",
    "WIDGETS":[
      "particles"
    ]
  },
  {
    "TITLE":"Microscope paramaters",
    "INST":"List the microscope parameters used during data collection to paramatize the CTF equation ",
    "WIDGETS":[
      "apix",
      "voltage",
      "cs"
    ]
  },
  {
    "TITLE":"CTF parameters",
    "INST":"List the amplitude contrast(using set to 10), and the oversampling(this can improve fitting of marginal data). Typically oversampling of 2 is fine.",
    "WIDGETS":[
      "ac",
      "oversamp"
    ]
  },
  {
    "TITLE":"CTF processing options",
    "INST":"To highpass the SNR, check 'autohp'. To disable smoothing of the background power curve, check 'nosmooth'. You almost always want to do this though. To use defcous from any previous fitting with e2ctf.py as a hint, check 'cudefocushint'.",
    "WIDGETS":[
      "autohp",
      "nosmooth",
      "curdefocushint"
    ]
  },
  {
    "TITLE":"Structure factor processing",
    "INST":"To compute structure factors directly after CTF autofitting, check 'computesf'. You almost never want to do this, as it's best to compute strucutre factors on only the best particle stacks. Initially the high resolution domains of the GroEL structure factors are used during CTF determination, however if 'sf' is set to auto, previously determined strucutre factors for this molecule are used if available(otherwise GroEL is used. To force GroEL use set 'sf' to none",
    "WIDGETS":[
      "computesf",
      "sf"
    ]
  }
]