/* JSON file for the tiltvalidation wizard */
[
  {
    "TITLE":"e2TiltValidate Wizard",
    "INST":"This Wizard is to Help EM users fill in the GUi to run e2tiltvalidat.py. For more info on this concept please read: Optimal Determination of Particle Orientation,Absolute Hand, and Contrast Loss in Single-particle. Electron Cryomicroscopy Rosenthal and Henderson",
    "WIDGETS":[]
  },
  {
    "TITLE":"Tilt Pair Filenames and Volume",
    "INST":"Please enter filename for the two tiltpair stacks and the volume to validate. Volume and stack must have same dimensions and APIX",
    "WIDGETS":[
      "untiltdata",
      "tiltdata",
      "volume"
    ]
  },
  {
    "TITLE":"e2tiltvalidation options",
    "INST": "The maximum tilt angle is the maximum allowed tilt angle allowed and computed angle above this threshold will be rejected. The quaternion checkbox, specifies that queernion mathematics are used for tilt axis/angle computation. Othervise, matrix mathematics are used.",
    "WIDGETS":[
      "maxtiltangle",
      "quaternion"
    ]
  },
  {
    "TITLE":"e2tiltvalidation options",
    "INST":"Please enter the symmetry of the volume you are validatibg and the parallism you wish to use",
    "WIDGETS":[
      "sym",
      "parallel"
    ]
  },
  {
    "TITLE":"e2project options",
    "INST":"Please enter the angluar projection spacing. The finer the spacing the more accurant your alignments will be",
    "WIDGETS":[
      "delta"
    ]
  },
  {
    "TITLE":"e2simmx options",
    "INST":"Please enter the shrink factor(int). The more shrinking the faster execution, but makes for less accurate alignments. Also select a comparitor to choose the best match between projections and images",
    "WIDGETS":[
      "shrink",
      "simcmp"
    ]
  },
  {
    "TITLE":"e2simmx options",
    "INST":"Please enter the similarity aligner, for use in image to projection alignment, and the compartior to use for this aligner",
    "WIDGETS":[
      "simalign",
      "simaligncmp"
    ]
  },
  {
    "TITLE":"e2tiltvalidation options",
    "INST":"Please enter the similarity refiement aligner, and comparitor to use for this aligner",
    "WIDGETS":[
      "simralign",
      "simraligncmp"
    ]
  }
]